/*
N皇后

描述

在鸣潮的世界中，天赋超群的觉醒者「吟霄」发现了来自古代文明的智力试炼棋盘。这个棋盘是一个n×n的战术模拟器，需要将每个皇后型元灵分别安放在棋盘上，使得它们无法互相感知或攻击。吟霄需要你的帮助来计算所有可能的布阵方式，以通过试炼获得远古知识。

输入

一个整数n，表示棋盘的边长，同时也是皇后的数量。

输出

输出所有合法的皇后放置方案，每种方案表示为一组字符串，其中'Q'表示皇后，'.'表示空位。每种方案输出一行，每一行将方案的每一行拼接后用空格隔开。

QQ截图20250505211856.png (./c76b2ac276.png)

输入样例 1

4

输出样例 1

[[".Q..","...Q","Q...","..Q."],["..Q.","Q...","...Q",".Q.."]]

来源

xmu

温馨提示

实在搞不定的话，你可以 点此下载测试数据 (./problem_5337_test_cases.zip)
*/

#include <iostream>

using namespace std;

int main()
{
    cout << "Hello world!" << endl;
    return 0;
}
