/*
传送费用

描述

​在《王者荣耀》的世界中，您作为战队的领队，需要派遣 2N 名英雄前往两座城市（A 城和 B 城）参加比赛。​每位英雄前往 A 城的传送费用为costs[i][0]，前往 B 城的传送费用为costs[i][1]。​您的任务是安排每座城市恰好接收 N 名英雄，并使总的传送费用最小化。

输入

    第一行包含一个整数 N，表示每座城市需要派遣的英雄数量（1 <= N <= 100）。​

    接下来的 2N 行，每行包含两个整数，分别表示一位英雄前往 A 城和 B 城的传送费用。

输出

一个整数，表示最小的总传送费用。

输入样例 1

2
10 20
30 200
400 50
30 20

输出样例 1

110

来源

xmu

温馨提示

实在搞不定的话，你可以 点此下载测试数据 (./problem_5272_test_cases.zip)
*/

#include <iostream>

using namespace std;

int main()
{
    cout << "Hello world!" << endl;
    return 0;
}
