/*
最长路径

描述

在《明日方舟》的世界中，罗德岛的干员们需要在一张地图上寻找一条路径，以完成任务。​

这张地图可以表示为一个 m x n 的整数矩阵，每个单元格代表一个区域，数值表示该区域的危险等级。​

干员们只能从当前区域移动到上下左右相邻的区域，且只能移动到危险等级更高的区域。​

请你找出干员们可以行进的最长路径的长度。

输入

每个输入文件包含：​

    第一行一个整数 m，表示地图的行数。

    接下来的 m 行，每行包含 n 个整数，表示地图的每一行。

输出

每个输出文件包含一个整数，表示干员们可以行进的最长路径的长度

QQ截图20250419221101.png (./ba1e599c59.png)

输入样例 1

3
9 9 4
6 6 8
2 1 1

输出样例 1

4

来源

xmu

温馨提示

实在搞不定的话，你可以 点此下载测试数据 (./problem_5310_test_cases.zip)
*/

#include <iostream>

using namespace std;

int main()
{
    cout << "Hello world!" << endl;
    return 0;
}
