/*
符文解码

描述

在王者峡谷中，法师女英雄“上官婉儿”偶然发现了一串神秘的通信符文。这些符文由数字 2~9 组成，疑似是远古荣耀神殿之间用于传递密令的方式。每个数字对应一些特定的字母（与现实中老式电话按键上的字母相同），而真正的密令隐藏在所有可能的字母组合中。

你作为辅助婉儿的召唤师，需要帮她破解这些通信符文，列出它可能代表的所有字母组合。

200px-telephone-keypad2svg.png (./9210a38a78.png)

输入

一个仅包含数字2到9的字符串，长度不超过 4。

输出

按任意顺序输出所有可能的字母组合，组合之间用空格分隔。

输入样例 1

23

输出样例 1

ad ae af bd be bf cd ce cf

来源

xmu

温馨提示

实在搞不定的话，你可以 点此下载测试数据 (./problem_5335_test_cases.zip)
*/

#include <iostream>

using namespace std;

int main()
{
    cout << "Hello world!" << endl;
    return 0;
}
